# Parameter Type Id Work Plane Param Property

Source: https://www.revitapidocs.com/2026/278e647d-bf4b-f0ab-c724-1b34ef354971.htm

---

| Parameter Type Id Work Plane Param Property |
| --- |

"Work Plane"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId WorkPlaneParam { get; }
```

```
Public Shared ReadOnly Property WorkPlaneParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ WorkPlaneParam {
	ForgeTypeId^ get ();
}
```

```
static member WorkPlaneParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace